# This notebook provides a live demo of the Teradata SQL notebook, executing SQL, running queries and magic commands. 

***

<h2>Live Demo Notebook </h2>
<p>
This notebook provides a simple demonstration of the Teradata SQL Notebook. It provides SQL statements to create sample tables
    and load sample data. You will be able to execute magic commands to query the tables and visualize simple chart options.
<p>

Add a connection to Teradata Vantage that has space to create tables and insert a small data set.
<p>
Establish a connection.

In [ ]:
%addconnect name=<connection name>, user=<user name>, host=<host name or IP>

In [ ]:
%connect <connection name>

You can use the Navigator to locate a database to create the demo tables. 
**Note:** Be sure that you do not have tables named **SalesCenter** or **SalesDemo** in the selected database.  Run the SQL command to set the database for the current session.

In [ ]:
Database <test database>

Create a table to store sales center data. First drop the table incase it already exists. This will fail if the table does not exist.

In [ ]:
drop table SalesCenter

In [ ]:
CREATE MULTISET TABLE SalesCenter ,NO FALLBACK ,
     NO BEFORE JOURNAL,
     NO AFTER JOURNAL,
     CHECKSUM = DEFAULT,
     DEFAULT MERGEBLOCKRATIO
     (
      Sales_Center_id INTEGER NOT NULL,
      Sales_Center_Name VARCHAR(255) CHARACTER SET LATIN NOT CASESPECIFIC)
NO PRIMARY INDEX ;

In [ ]:
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1111,'Phoenix') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(2222,'Bend') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(3333,'Omaha') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(4444,'Louisville') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(5555,'Bismark') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(6666,'Memphis') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(7777,'Monroe') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(8888,'San Diego') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(9999,'Redding') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1112,'South Bend') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1113,'Jacksonville') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1114,'Fort Wayne') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1115,'Billings') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1116,'Portland') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1117,'Ashland') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1118,'Wacco') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(1119,'Flint') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(2000,'Arlington') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(2111,'Bakersfield') ;
INSERT INTO "SalesCenter"  ("Sales_Center_id", "Sales_Center_Name")  VALUES(3111,'Orange') ;

Verify data was inserted.

In [ ]:
select * from salescenter order by 1

Create a table with sales demo data.

In [ ]:
drop table salesdemo

In [ ]:
CREATE MULTISET TABLE SalesDemo ,NO FALLBACK ,
     NO BEFORE JOURNAL,
     NO AFTER JOURNAL,
     CHECKSUM = DEFAULT,
     DEFAULT MERGEBLOCKRATIO
     (
      Sales_Center_ID INTEGER NOT NULL,
      UNITS DECIMAL(15,4),
      SALES DECIMAL(15,2),
      COST DECIMAL(15,2))
NO PRIMARY INDEX ;

In [ ]:
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1111,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(2222,1.0000,18.75,9.50);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(3333,5.0000,32.00,12.80);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(4444,1.0000,20.85,9.50);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(5555,1.0000,7.97,3.89);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(6666,1.0000,18.75,5.20);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(7777,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(8888,1.0000,10.60,5.36);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(9999,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1112,1.0000,8.00,2.65);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1113,5.0000,39.42,10.68);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1114,5.0000,35.58,15.84);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1115,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1116,1.0000,17.18,2.69);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1117,1.0000,9.50,3.01);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1118,4.0000,27.10,6.79);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1119,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(2111,4.0000,29.00,13.63);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(3111,21.0000,55.00,57.98);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1111,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(2222,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(3333,10.0000,43.78,77.42);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(4444,70.0000,65.73,238.20);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(5555,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(6666,1.0000,7.79,4.51);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(7777,1.0000,15.25,7.27);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(8888,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(9999,0.0000,0.00,0.00);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1112,3.0000,19.36,10.05);
INSERT INTO "SalesDemo"  ("Sales_Center_ID", "UNITS", "SALES", "COST")  VALUES(1113,1.0000,16.50,10.99);

Verify that the sales demo data inserted successfully.

In [ ]:
select * from salesdemo order by sales

You can now open a Navigator for your connection and verify that the tables were created. Run a row count on the tables to verify the data was loaded.

Create a result set from the sales data.

In [ ]:
select f.sales, f.sales_center_id, s.sales_center_name from salesdemo f
  inner join salescenter s on s.Sales_Center_id = f.Sales_Center_id

The charting magic allows you to quickly visualize the result, providing x and y axes for the chart.

In [ ]:
%chart sales_center_name,sales, title=Sales Data

Change the chart to a point chart by passing the mark=point option.

In [ ]:
%chart sales_center_name, sales,mark=point,title=Sales Data Point

Run the %history magic to view past query results.

In [ ]:
%history

Locate the history ID for query 'select * from salesdemo order by sales' that was run above.
<p>
Run the %chart magic and pass in the ResultSet id. For example, id of 29 is used below.

In [ ]:
%chart sales_center_id,sales, id=29

You can also retrieve a ResultSet from the history by running the %table magic, passing a ResultSet id.

In [ ]:
%table 30

As mentioned in the Getting Started notebook, you can copy a resultset path and paste it into panda or data frame command in a Python or R notebook. Click the Copy icon at the top of the ResultSet output. 
<p>
Open a Python notebook with the following statement:

```python
import pandas as pd
df = pd.read_json("")
df
```
Paste the result set path into a Python notebook using the command **pd.read_json("<ResultSetPath>")**<br>
For example:<br>
    
```python
df = pd.read_json("/home/jovyan/JupyterLabRoot/Teradata/Resultsets/2018.08.02_16.13.05.164_UTC/00001.json")
```

Drop tables to clean up data.

In [ ]:
drop table SalesCenter;

In [ ]:
drop table salesdemo;

Copyright 2018-2019 Teradata. All rights reserved.